[
    {
        "id": "2",
        "category": "VR",
        "title": "Agent 0",
        "image": "/assets/images/vr/construction-scene.jpg",
        "files": [
            "https://codechemist.se//Videos/638607408709817665.mp4",
            "https://codechemist.se//Videos/638606668680790736.mp4"        ],
        "projectInformation": [
            "Development Time: 5 weeks",
            "Software: Unity",
            "VR-headset: Oculus Quest 2",
            "Toolkit: XR Interaction Toolkit",
            "Scenes: Blender",
            "Assets: Unity",
            "Sound: FMOD",
            "Characters: Mixamo",
            "Character Animation: Mixamo"
        ],
        "projectPurpose": "<p>This was my second project, where I developed a VR story-based game over a 5-week period. As a solo project, I was responsible for both programming and 3D modeling. The game centers around a player who takes on the role of an agent, completing missions that start and end at a central base. After each mission, the player returns to the base to receive new assignments, creating a dynamic and engaging gameplay loop.</p> <p>Throughout this project, I expanded my skills in C# programming and gained experience with Unity's AI systems and animations. Additionally, I modeled the game scenes using Blender and learned to work with FMOD for audio integration. This project allowed me to successfully combine technical programming with creative storytelling, resulting in an immersive VR experience.</p>"
    },
    {
        "id": "6",
        "category": "VR",
        "title": "VR DJ",
        "image": "/assets/images/vr/dj.jpg",
        "files": [],
        "projectInformation": [
            "Development Time: 4 weeks",
            "Software: Unity",
            "VR-headset: Oculus Quest 2",
            "Toolkit: XR Interaction Toolkit",
            "DJ Table: Blender",
            "Sound: FMOD"
        ],
        "projectPurpose": "<p>This was my third project, and the goal was to learn how to work in a team. We were four people collaborating on this project, which had to be completed in less than a month. The theme of the project was music, and I was responsible for creating the DJ functionality in the VR experience. This involved handling the programming part, which I am most interested in. The goal was for the player to imagine being Avicii and playing Avicii's songs in a DJ environment.</p><p>During the project, I learned a lot about teamwork and how to effectively divide tasks. Each of us focused on different parts of the project, which gave me valuable experience in working together towards a common goal. I also developed my skills in C# programming, working with the XR Interaction Toolkit, and FMOD.</p>"
    },
    {
        "id": "10",
        "category": "VR",
        "title": "Shooting Targets & Zombies",
        "image": "/assets/images/vr/zombie.jpg",
        "files": [
            "/assets/videos/Agent 0 Game.mp4"
         ],
        "projectInformation": [
            "Development Time: 2 months",
            "Software: Unity",
            "VR-headset: Oculus Quest 2",
            "Toolkit: XR Interaction Toolkit",
            "Scenes: Blender",
            "Assets: Unity",
            "Sound: FMOD",
            "Characters: Mixamo",
            "Character Animation: Mixamo"
        ],
        "projectPurpose": ""
    },
    {
        "id": "5",
        "category": "Blender",
        "title": "Inside a house 3D",
        "image": "/assets/images/blender/house-3d/toilet.jpg",
        "files": [
            "/assets/images/blender/house-3d/inside.jpg",
            "/assets/images/blender/house-3d/livingroom.jpg",
            "/assets/images/blender/house-3d/bedroom.jpg",
            "/assets/images/blender/house-3d/hall.jpg",
            "/assets/images/blender/house-3d/kitchen.jpg",
            "/assets/images/blender/house-3d/toilet.jpg"
        ],
        "projectInformation": [
            "Development Time: 3 months",
            "Software: Blender",
            "Vertices: 65,184",
            "Edges: 122,502",
            "Faces: 58,264",
            "Triangles: 119,376",
            "Export To: None"
        ],
        "projectPurpose": "For my first modeling project in Blender, I focused on experimenting with the interior design of a house, including two bedrooms, a living room, a kitchen, and a bathroom. This project was essential for learning the basics of Blender, as it allowed me to practice creating detailed models and become familiar with the software's environment and shortcut keys. Through this process, I gained foundational skills in 3D modeling, which set the stage for more advanced projects."
    },
    {
        "id": "9",
        "category": "Blender",
        "title": "Shooting Range 3D Scene",
        "image": "/assets/images/blender/target-scene.jpg",
        "files": [
            "/assets/gifs/shooting-target-scene.gif"
        ],
        "projectInformation": [
            "Development Time: 3 weeks",
            "Software: Blender",
            "Vertices: 16,581",
            "Edges: 33,067",
            "Faces: 16,548",
            "Triangles: 33,553",
            "Export To: Unity"
        ],
        "projectPurpose": "<p>For my second Blender project, I designed a highly optimized 3D scene specifically intended for integration into Unity for a VR game I was developing.</p> <p>This project was a critical learning experience, as it required me to focus on efficient modeling techniques to ensure the scene would perform well within the Unity engine, especially in a VR context. Through this process, I gained valuable insights into the importance of optimization and proper modeling practices, which are essential for creating immersive and responsive VR experiences. This project not only enhanced my technical skills but also deepened my understanding of the crucial relationship between Blender and Unity in game development.</p>"
    },
    {
        "id": "11",
        "category": "Blender",
        "title": "Shipment 3D Scene",
        "image": "/assets/images/blender/shipment-3d/shipment-3d-4.jpg",
        "files": [
            "/assets/images/blender/shipment-3d/shipment-3d-1.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-2.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-3.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-4.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-5.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-6.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-7.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-8.jpg",
            "/assets/images/blender/shipment-3d/shipment-3d-9.jpg"
        ],
        "projectInformation": [
            "Development Time: 2 weeks",
            "Software: Blender",
            "Vertices: 65,184",
            "Edges: 122,502",
            "Faces: 58,264",
            "Triangles: 119,376",
            "Export To: Unity"
        ],
        "projectPurpose": "<p>For my third project using Blender, I created a scene specifically for my VR game, Agent 0. The scene I developed was central to the game, drawing inspiration from the classic Shipment map from Call of Duty. The goal was to create a detailed and functional scene in a short amount of time, taking inspiration from existing games to enhance my 3D modeling skills.</p><p>This project significantly improved my modeling abilities and deepened my understanding of the importance of optimization in game development, even though the optimization aspect still requires further polishing.</p>"
    },
    {
        "id": "3",
        "category": "Backend",
        "title": ".NET Course Application API",
        "image": "/assets/images/angular-images/codechemist-api.jpg",
        "files": [
            "/assets/images/angular-images/codechemist-api.jpg",
            "/assets/images/angular-images/Skärmbild 2024-08-20 184120.png"
        ],
        "projectInformation": [
            "Backend: .NET",
            "Language: JavaScript",
            "Frontend: Angular",
            "Database: SQL",
            "Server: Loopia",
            "Authentication: JWT Token",
            "Cloud Storage: Cloudinary",
            "ORM: Entity Framework",
            "Development Tool: Swagger"
        ],
        "projectPurpose": "<p>Building on the foundational knowledge from my first project, the .NET Course Application API showcases the advanced skills and practices I’ve developed. This project involved designing a robust API with five controllers using a three-layer architecture (Repository, Service, Controller) for clean code organization and efficient data management.</p> <p>I used SQL for the database, hosted on Loopia’s cloud platform for better scalability and security, and employed asynchronous programming to enhance performance. Unlike my first project, which utilized Cloudinary for music and images, this project focused on storing images with Cloudinary. For managing large files and ZIP files for Unity WebGL games, I developed a custom file repository to address Cloudinary’s file size limitations.</p> <p>Additionally, I implemented an advanced authentication system with email verification via SMTP services and integrated comprehensive error handling to improve user experience and simplify troubleshooting. <strong>This API was published and is currently in use</strong>, demonstrating my ability to apply learned skills in a real-world setting, manage complex data, and integrate various functionalities into a cohesive and performant web application.</p>"
    },
    {
        "id": "4",
        "category": "Frontend",
        "title": "Angular Course Application",
        "image": "/assets/images/angular-images/codechemist-front.jpg",
        "files": [
            "/assets/images/angular-images/codechemist-front.jpg"
        ],
        "projectInformation": [
            "JS Framework: Angular",
            "Language: TypeScript",
            "Backend: .NET",
            "Development Tool: Node.js",
            "CSS Framework: Bootstrap",
            "Video Player: Video.js",
            "Reactive Programming: RxJS"
        ],
        "projectPurpose": "<p>The Angular Course Application is my second project using a JavaScript framework, this time with Angular. This project deepened my understanding of modern front-end frameworks and showcased Angular’s robust features.</p> <p>I fully embraced TypeScript, leveraging its powerful features like interfaces and type safety to maintain a reliable and clean codebase. I utilized RxJS and Angular services, which are crucial for managing asynchronous operations and aligning with Angular's best practices.</p> <p>I also implemented robust validation, integrated Bootstrap for responsive design, and used Angular guards to secure routes. The application was designed to be dynamic and extensible, making future feature additions straightforward.</p> <p><strong>After completing development, the application was published</strong>, reflecting a significant advancement in my front-end skills with Angular and TypeScript.</p>"
    },
    {
        "id": "7",
        "category": "Backend",
        "title": ".NET Music Application API",
        "image": "/assets/images/vue-images/music-api.jpg",
        "files": [
            "/assets/images/Guldlock.jpg",
            "https://codechemist.se/assets/images/codechemist.svg"
        ],
        "projectInformation": [
            "Backend: .NET",
            "Language: JavaScript",
            "Frontend: Vue",
            "Database: SQL",
            "Server: Loopia",
            "Authentication: JWT Token",
            "Cloud Storage: Cloudinary",
            "ORM: Entity Framework",
            "Development Tool: Swagger"
        ],
        "projectPurpose": "<p>As my first venture into Web API development, the .NET Music Application API was primarily a learning project. It was designed to help me grasp the fundamental concepts of API design and implementation.</p> <p>The API focused on managing relationships between artists and songs, using SQL for effective database management. I implemented a service layer to keep the controllers clean and focused, gaining experience in structuring applications for better organization.</p> <p>Asynchronous programming was introduced to improve responsiveness. Key features like pagination and filtering were added, providing practical experience in data management.</p> <p>I also integrated Cloudinary to store music and images, giving me a solid understanding of working with cloud services. Basic .NET authentication for user registration and login was implemented, laying the groundwork for future enhancements.</p> <p>Overall, this project was a crucial step in my learning journey.</p>"
    },
    {
        "id": "8",
        "category": "Frontend",
        "title": "Vue Music Application",
        "image": "/assets/images/vue-images/music-front.jpg",
        "files": [
            "/assets/images/vue-images/music-front.jpg"
        ],
        "projectInformation": [
            "JS Framework: Vue",
            "Language: JavaScript",
            "Backend: .NET",
            "Development Tool: Node.js",
            "API: Vue Composition API"
        ],
        "projectPurpose": "<p>The Vue Music Application was my first venture into using a JavaScript framework, specifically Vue.js. This project was primarily a learning experience where I focused on understanding Vue.js and its Composition API.</p> <p>I integrated the .NET Music Application API I had previously developed and implemented CRUD operations to interact with the API. I also added features like pagination and filtering to learn how to handle algorithms in JavaScript and to allow users to search and navigate song data efficiently.</p> <p>This project provided a hands-on introduction to the Vue ecosystem and helped me build skills in JavaScript, HTML, and CSS. It was a crucial step in my development journey, giving me a solid foundation in modern JavaScript frameworks.</p>"
    }
]